<?php

declare(strict_types=1);

namespace Modules\Address\Database\Seeders;

use Illuminate\Database\Seeder;
use Modules\Address\Models\Region;

class RegionSeeder extends Seeder
{
    public function run(): void
    {
        $regions = [
            'Вінницька область',
            'Волинська область',
            'Дніпропетровська область',
            'Донецька область',
            'Житомирська область',
            'Закарпатська область',
            'Запорізька область',
            'Івано-Франківська область',
            'Київська область',
            'Кіровоградська область',
            'Луганська область',
            'Львівська область',
            'Миколаївська область',
            'Одеська область',
            'Полтавська область',
            'Рівненська область',
            'Сумська область',
            'Тернопільська область',
            'Харківська область',
            'Херсонська область',
            'Хмельницька область',
            'Черкаська область',
            'Чернівецька область',
            'Чернігівська область',
            'Автономна Республіка Крим',
            'м. Київ',
            'м. Севастополь',
        ];

        foreach ($regions as $name) {
            Region::query()->firstOrCreate(['name' => $name]);
        }
    }
}
